In [1]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__ , np.__version__

('1.0.5', '1.19.5')

In [4]:
df = pd.DataFrame([[2, 4, 7, 8, 1, 3, 2013], [9, 2, 4, 5, 5, 6, 2014]], columns=['Amy', 'Bob', 'Carl', 'Chris', 'Ben', 'Other', 'Year'])
df

   Amy  Bob  Carl  Chris  Ben  Other  Year
0    2    4     7      8    1      3  2013
1    9    2     4      5    5      6  2014

In [5]:
d = {'A': ['Amy'], 'B': ['Bob', 'Ben'], 'C': ['Carl', 'Chris']}
d

{'A': ['Amy'], 'B': ['Bob', 'Ben'], 'C': ['Carl', 'Chris']}

In [10]:
#Needed
#     Group   Name  Year  Value
#  0      A    Amy  2013      2
#  1      A    Amy  2014      9
#  2      B    Bob  2013      4
#  3      B    Bob  2014      2
#  4      B    Ben  2013      1
#  5      B    Ben  2014      5
#  6      C   Carl  2013      7
#  7      C   Carl  2014      4
#  8      C  Chris  2013      8
#  9      C  Chris  2014      5
# 10  Other         2013      3
# 11  Other         2014      6

In [11]:
m = pd.melt(df, id_vars=['Year'], var_name='Name')
m

    Year   Name  value
0   2013    Amy      2
1   2014    Amy      9
2   2013    Bob      4
3   2014    Bob      2
4   2013   Carl      7
5   2014   Carl      4
6   2013  Chris      8
7   2014  Chris      5
8   2013    Ben      1
9   2014    Ben      5
10  2013  Other      3
11  2014  Other      6

In [12]:
d2 = {}

In [13]:
for k, v in d.items():
    for item in v:
        d2[item] = k

In [14]:
d2

{'Amy': 'A', 'Bob': 'B', 'Ben': 'B', 'Carl': 'C', 'Chris': 'C'}

In [15]:
m['Group'] = m['Name'].map(d2)

In [16]:
m

    Year   Name  value Group
0   2013    Amy      2     A
1   2014    Amy      9     A
2   2013    Bob      4     B
3   2014    Bob      2     B
4   2013   Carl      7     C
5   2014   Carl      4     C
6   2013  Chris      8     C
7   2014  Chris      5     C
8   2013    Ben      1     B
9   2014    Ben      5     B
10  2013  Other      3   NaN
11  2014  Other      6   NaN